Revit 2015 API
ViewShapeBuilder Class
 Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object. Currently limited to curve-based representations for plan and elevation views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public class ViewShapeBuilder : IDisposable
Visual Basic
Public Class ViewShapeBuilder _
	Implements IDisposable
Visual C++
public ref class ViewShapeBuilder : IDisposable
Remarks
 The validation functionality is used by DirectShape to validate the incoming shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewShapeBuilder
See Also
ViewShapeBuilder Members
Autodesk.Revit.DB Namespace